cfg/Enums/ВидыТекстовЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыТекстовЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTMLСКартинками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/CommonForms/НастройкаОтправкиОтчета/Ext/Form/Module.bsl
Процедура ПриОткрытии()
	
	ВосстановитьЗначения();
	
КонецПроцедуры

Функция ПолучитьДвоичныеДанные(ИмяФайла)

	Файл = Новый Файл(ИмяФайла);
	
	Если Файл.Существует() Тогда
		Данные = Новый ДвоичныеДанные(ИмяФайла);
		Попытка
			УдалитьФайлы(ИмяФайла);
		Исключение
		КонецПопытки;
		Возврат Данные;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	

КонецФункции

Процедура ОсновныеДействияФормыOK(Кнопка)
	
	СохранитьЗначения();
	
	СтруктураНовогоПисьма = Новый Структура;
	
	Если ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.Текст Тогда
		
		СтруктураНовогоПисьма.Вставить("ВидТекста", Перечисления.ВидыТекстовЭлектронныхПисем.Текст);
		ФайлВФорматеТекст = ПолучитьИмяВременногоФайла();
		Отчет.Записать(ФайлВФорматеТекст, ТипФайлаТабличногоДокумента.TXT);
		ТекстПисьма = Новый ТекстовыйДокумент;
		ТекстПисьма.Прочитать(ФайлВФорматеТекст);
		ТекстПисьма.ВставитьСтроку(1, "------------------------------------------------------");
		ТекстПисьма.ВставитьСтроку(1, "");
		ТекстСообщенияДляОтправки = ТекстПисьма.ПолучитьТекст();
		СтруктураНовогоПисьма.Вставить("Тело", ТекстСообщенияДляОтправки);
		УдалитьФайлы(ФайлВФорматеТекст);
		
	ИначеЕсли ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML Тогда
		
		СтруктураНовогоПисьма.Вставить("ВидТекста", Перечисления.ВидыТекстовЭлектронныхПисем.HTML);
		ФайлВФорматеHTML = ПолучитьИмяВременногоФайла();
		Отчет.Записать(ФайлВФорматеHTML, ТипФайлаТабличногоДокумента.HTML);
		ТекстПисьма = Новый ТекстовыйДокумент;
		ТекстПисьма.Прочитать(ФайлВФорматеHTML);
		
		ХТМЛТекст = ТекстПисьма.ПолучитьТекст();
		
		НовыйHTMLДокумент = Новый COMОбъект("HtmlFile");
		НовыйHTMLДокумент.open("text/html");
		НовыйHTMLДокумент.write(ХТМЛТекст);
		НовыйHTMLДокумент.close();
		
		ТегТела = НовыйHTMLДокумент.all.tags("BODY");
		Для а = 0 По ТегТела.length - 1 Цикл
			ТегТела.item(а).innerHTML = "
			|<P><BR><BR><BR>
			|<HR>
			|</P>
			|<P></P>" + ТегТела.item(а).innerHTML;
		КонецЦикла;
		
		ТекстСообщенияДляОтправки = "";
		Для а = 0 По НовыйHTMLДокумент.all.length - 1 Цикл
			Если НовыйHTMLДокумент.all.item(а).tagName = "HTML" Тогда
				ТекстСообщенияДляОтправки = НовыйHTMLДокумент.all.item(а).innerHTML;
			КонецЕсли; 
		КонецЦикла;
		
		СтруктураНовогоПисьма.Вставить("Тело", ТекстСообщенияДляОтправки);
		УдалитьФайлы(ФайлВФорматеТекст);
		
	Иначе
		
		СтруктураНовогоПисьма.Вставить("ВидТекста", Перечисления.ВидыТекстовЭлектронныхПисем.Текст);
		
	КонецЕсли; 
	
	СтруктураНовогоПисьма.Вставить("Тема", ТемаСообщения);
	
	СписокФайловВложений = Новый СписокЗначений;
	
	Если НЕ ЗначениеЗаполнено(ИмяФайлаВложения) Тогда
		ИмяФайлаВложения = ТемаСообщения;
	Иначе
		ИмяФайлаВложения = ИмяФайлаВложения;
	КонецЕсли; 
	
	Если ВложенияHTML Тогда
		Если ФайлВФорматеHTML = Неопределено Тогда
			ФайлВФорматеHTML = ПолучитьИмяВременногоФайла();
			Отчет.Записать(ФайлВФорматеHTML, ТипФайлаТабличногоДокумента.HTML);
		КонецЕсли;
		СписокФайловВложений.Добавить(Новый Структура("Хранилище, ИмяФайла, Наименование", ПолучитьДвоичныеДанные(ФайлВФорматеHTML), (ИмяФайлаВложения + ".HTM"), ИмяФайлаВложения));
	КонецЕсли; 
	
	Если ВложенияTXT Тогда
		Если ФайлВФорматеТекст = Неопределено Тогда
			ФайлВФорматеТекст = ПолучитьИмяВременногоФайла();
			Отчет.Записать(ФайлВФорматеТекст, ТипФайлаТабличногоДокумента.TXT);
		КонецЕсли; 
		СписокФайловВложений.Добавить(Новый Структура("Хранилище, ИмяФайла, Наименование", ПолучитьДвоичныеДанные(ФайлВФорматеТекст), (ИмяФайлаВложения + ".TXT"), ИмяФайлаВложения));
	КонецЕсли; 
	
	Если ВложенияMXL Тогда
		ФайлВФорматеMXL = ПолучитьИмяВременногоФайла();
		Отчет.Записать(ФайлВФорматеMXL, ТипФайлаТабличногоДокумента.MXL);
		СписокФайловВложений.Добавить(Новый Структура("Хранилище, ИмяФайла, Наименование", ПолучитьДвоичныеДанные(ФайлВФорматеMXL), (ИмяФайлаВложения + ".MXL"), ИмяФайлаВложения));
	КонецЕсли; 
	
	Если ВложенияXLS Тогда
		ФайлВФорматеXLS = ПолучитьИмяВременногоФайла();
		Отчет.Записать(ФайлВФорматеXLS, ТипФайлаТабличногоДокумента.XLS);
		СписокФайловВложений.Добавить(Новый Структура("Хранилище, ИмяФайла, Наименование", ПолучитьДвоичныеДанные(ФайлВФорматеXLS), (ИмяФайлаВложения + ".XLS"), ИмяФайлаВложения));
	КонецЕсли;
	
	Если СписокФайловВложений.Количество() > 0 Тогда
		СтруктураНовогоПисьма.Вставить("СписокФайловВложений", СписокФайловВложений);
	КонецЕсли; 
	
	СтруктураСозданногоПисьма = УправлениеЭлектроннойПочтой.НаписатьПисьмо(глЗначениеПеременной("глТекущийПользователь"),СтруктураНовогоПисьма,,,,,, Истина, Ложь);
	
	ЭтаФорма.Закрыть();
	
	Если ТипЗнч(СтруктураСозданногоПисьма) = Тип("Структура") Тогда
		СтруктураСозданногоПисьма.Форма.Открыть();
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьЗначения()

	СтруктураЗначений = Новый Структура();
	СтруктураЗначений.Вставить("ВидТекстаПисьма", ВидТекстаПисьма);
	СтруктураЗначений.Вставить("ВложенияHTML"   , ВложенияHTML);
	СтруктураЗначений.Вставить("ВложенияMXL"    , ВложенияMXL);
	СтруктураЗначений.Вставить("ВложенияTXT"    , ВложенияTXT);
	СтруктураЗначений.Вставить("ВложенияXLS"    , ВложенияXLS);
	
	СохранитьЗначение("НастройкиОтправкиОтчетов", СтруктураЗначений);

КонецПроцедуры

Процедура ВосстановитьЗначения()

	Перем ЗначениеСтруктуры;
	
	ВосстановленноеЗначение = ВосстановитьЗначение("НастройкиОтправкиОтчетов");
	
	Если ТипЗнч(ВосстановленноеЗначение) = Тип("Структура") Тогда
		ВосстановленноеЗначение.Свойство("ВидТекстаПисьма", ЗначениеСтруктуры);
		Если ЗначениеСтруктуры = Неопределено Тогда
			ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML;
		Иначе
			ВидТекстаПисьма = ЗначениеСтруктуры;
		КонецЕсли; 
		ВосстановленноеЗначение.Свойство("ВложенияHTML", ЗначениеСтруктуры);
		Если ЗначениеСтруктуры <> Неопределено Тогда
			ВложенияHTML = ЗначениеСтруктуры;
		КонецЕсли; 
		ВосстановленноеЗначение.Свойство("ВложенияMXL", ЗначениеСтруктуры);
		Если ЗначениеСтруктуры <> Неопределено Тогда
			ВложенияMXL = ЗначениеСтруктуры;
		КонецЕсли; 
		ВосстановленноеЗначение.Свойство("ВложенияTXT", ЗначениеСтруктуры);
		Если ЗначениеСтруктуры <> Неопределено Тогда
			ВложенияTXT = ЗначениеСтруктуры;
		КонецЕсли; 
		ВосстановленноеЗначение.Свойство("ВложенияXLS", ЗначениеСтруктуры);
		Если ЗначениеСтруктуры <> Неопределено Тогда
			ВложенияXLS = ЗначениеСтруктуры;
		КонецЕсли; 
	Иначе
		ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML;
		ВложенияXLS = Истина;
	КонецЕсли; 

КонецПроцедуры
